MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8T1AFDCBD/mcu.h
        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR26_b;
    };

    union
    {
        __IOM uint8_t VBTBKR27;        /*!< (@ 0x00000D1B) VBATT Backup Register 27                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR27_b;
    };

    union
    {
        __IOM uint8_t VBTBKR28;        /*!< (@ 0x00000D1C) VBATT Backup Register 28                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR28_b;
    };

    union
    {
        __IOM uint8_t VBTBKR29;        /*!< (@ 0x00000D1D) VBATT Backup Register 29                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR29_b;
    };

    union
    {
        __IOM uint8_t VBTBKR30;        /*!< (@ 0x00000D1E) VBATT Backup Register 30                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR30_b;
    };

    union
    {
        __IOM uint8_t VBTBKR31;        /*!< (@ 0x00000D1F) VBATT Backup Register 31                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR31_b;
    };

    union
    {
        __IOM uint8_t VBTBKR32;        /*!< (@ 0x00000D20) VBATT Backup Register 32                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR32_b;
    };

    union
    {
        __IOM uint8_t VBTBKR33;        /*!< (@ 0x00000D21) VBATT Backup Register 33                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR33_b;
    };

    union
    {
        __IOM uint8_t VBTBKR34;        /*!< (@ 0x00000D22) VBATT Backup Register 34                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR34_b;
    };

    union
    {
        __IOM uint8_t VBTBKR35;        /*!< (@ 0x00000D23) VBATT Backup Register 35                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR35_b;
    };

    union
    {
        __IOM uint8_t VBTBKR36;        /*!< (@ 0x00000D24) VBATT Backup Register 36                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR36_b;
    };

    union
    {
        __IOM uint8_t VBTBKR37;        /*!< (@ 0x00000D25) VBATT Backup Register 37                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR37_b;
    };

    union
    {
        __IOM uint8_t VBTBKR38;        /*!< (@ 0x00000D26) VBATT Backup Register 38                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR38_b;
    };

    union
    {
        __IOM uint8_t VBTBKR39;        /*!< (@ 0x00000D27) VBATT Backup Register 39                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR39_b;
    };

    union
    {
        __IOM uint8_t VBTBKR40;        /*!< (@ 0x00000D28) VBATT Backup Register 40                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR40_b;
    };

    union
    {
        __IOM uint8_t VBTBKR41;        /*!< (@ 0x00000D29) VBATT Backup Register 41                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR41_b;
    };

    union
    {
        __IOM uint8_t VBTBKR42;        /*!< (@ 0x00000D2A) VBATT Backup Register 42                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR42_b;
    };

    union
    {
        __IOM uint8_t VBTBKR43;        /*!< (@ 0x00000D2B) VBATT Backup Register 43                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR43_b;
    };

    union
    {
        __IOM uint8_t VBTBKR44;        /*!< (@ 0x00000D2C) VBATT Backup Register 44                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR44_b;
    };

    union
    {
        __IOM uint8_t VBTBKR45;        /*!< (@ 0x00000D2D) VBATT Backup Register 45                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR45_b;
    };

    union
    {
        __IOM uint8_t VBTBKR46;        /*!< (@ 0x00000D2E) VBATT Backup Register 46                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR46_b;
    };

    union
    {
        __IOM uint8_t VBTBKR47;        /*!< (@ 0x00000D2F) VBATT Backup Register 47                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR47_b;
    };

    union
    {
        __IOM uint8_t VBTBKR48;        /*!< (@ 0x00000D30) VBATT Backup Register 48                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR48_b;
    };

    union
    {
        __IOM uint8_t VBTBKR49;        /*!< (@ 0x00000D31) VBATT Backup Register 49                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR49_b;
    };

    union
    {
        __IOM uint8_t VBTBKR50;        /*!< (@ 0x00000D32) VBATT Backup Register 50                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR50_b;
    };

    union
    {
        __IOM uint8_t VBTBKR51;        /*!< (@ 0x00000D33) VBATT Backup Register 51                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR51_b;
    };

    union
    {
        __IOM uint8_t VBTBKR52;        /*!< (@ 0x00000D34) VBATT Backup Register 52                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR52_b;
    };

    union
    {
        __IOM uint8_t VBTBKR53;        /*!< (@ 0x00000D35) VBATT Backup Register 53                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR53_b;
    };

    union
    {
        __IOM uint8_t VBTBKR54;        /*!< (@ 0x00000D36) VBATT Backup Register 54                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR54_b;
    };

    union
    {
        __IOM uint8_t VBTBKR55;        /*!< (@ 0x00000D37) VBATT Backup Register 55                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR55_b;
    };

    union
    {
        __IOM uint8_t VBTBKR56;        /*!< (@ 0x00000D38) VBATT Backup Register 56                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR56_b;
    };

    union
    {
        __IOM uint8_t VBTBKR57;        /*!< (@ 0x00000D39) VBATT Backup Register 57                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR57_b;
    };

    union
    {
        __IOM uint8_t VBTBKR58;        /*!< (@ 0x00000D3A) VBATT Backup Register 58                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR58_b;
    };

    union
    {
        __IOM uint8_t VBTBKR59;        /*!< (@ 0x00000D3B) VBATT Backup Register 59                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR59_b;
    };

    union
    {
        __IOM uint8_t VBTBKR60;        /*!< (@ 0x00000D3C) VBATT Backup Register 60                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR60_b;
    };

    union
    {
        __IOM uint8_t VBTBKR61;        /*!< (@ 0x00000D3D) VBATT Backup Register 61                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR61_b;
    };

    union
    {
        __IOM uint8_t VBTBKR62;        /*!< (@ 0x00000D3E) VBATT Backup Register 62                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR62_b;
    };

    union
    {
        __IOM uint8_t VBTBKR63;        /*!< (@ 0x00000D3F) VBATT Backup Register 63                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR63_b;
    };

    union
    {
        __IOM uint8_t VBTBKR64;        /*!< (@ 0x00000D40) VBATT Backup Register 64                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR64_b;
    };

    union
    {
        __IOM uint8_t VBTBKR65;        /*!< (@ 0x00000D41) VBATT Backup Register 65                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR65_b;
    };

    union
    {
        __IOM uint8_t VBTBKR66;        /*!< (@ 0x00000D42) VBATT Backup Register 66                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR66_b;
    };

    union
    {
        __IOM uint8_t VBTBKR67;        /*!< (@ 0x00000D43) VBATT Backup Register 67                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR67_b;
    };

    union
    {
        __IOM uint8_t VBTBKR68;        /*!< (@ 0x00000D44) VBATT Backup Register 68                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR68_b;
    };

    union
    {
        __IOM uint8_t VBTBKR69;        /*!< (@ 0x00000D45) VBATT Backup Register 69                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR69_b;
    };

    union
    {
        __IOM uint8_t VBTBKR70;        /*!< (@ 0x00000D46) VBATT Backup Register 70                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR70_b;
    };

    union
    {
        __IOM uint8_t VBTBKR71;        /*!< (@ 0x00000D47) VBATT Backup Register 71                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR71_b;
    };

    union
    {
        __IOM uint8_t VBTBKR72;        /*!< (@ 0x00000D48) VBATT Backup Register 72                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR72_b;
    };

    union
    {
        __IOM uint8_t VBTBKR73;        /*!< (@ 0x00000D49) VBATT Backup Register 73                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR73_b;
    };

    union
    {
        __IOM uint8_t VBTBKR74;        /*!< (@ 0x00000D4A) VBATT Backup Register 74                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR74_b;
    };

    union
    {
        __IOM uint8_t VBTBKR75;        /*!< (@ 0x00000D4B) VBATT Backup Register 75                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR75_b;
    };

    union
    {
        __IOM uint8_t VBTBKR76;        /*!< (@ 0x00000D4C) VBATT Backup Register 76                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR76_b;
    };

    union
    {
        __IOM uint8_t VBTBKR77;        /*!< (@ 0x00000D4D) VBATT Backup Register 77                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR77_b;
    };

    union
    {
        __IOM uint8_t VBTBKR78;        /*!< (@ 0x00000D4E) VBATT Backup Register 78                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR78_b;
    };

    union
    {
        __IOM uint8_t VBTBKR79;        /*!< (@ 0x00000D4F) VBATT Backup Register 79                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR79_b;
    };

    union
    {
        __IOM uint8_t VBTBKR80;        /*!< (@ 0x00000D50) VBATT Backup Register 80                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR80_b;
    };

    union
    {
        __IOM uint8_t VBTBKR81;        /*!< (@ 0x00000D51) VBATT Backup Register 81                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR81_b;
    };

    union
    {
        __IOM uint8_t VBTBKR82;        /*!< (@ 0x00000D52) VBATT Backup Register 82                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR82_b;
    };

    union
    {
        __IOM uint8_t VBTBKR83;        /*!< (@ 0x00000D53) VBATT Backup Register 83                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR83_b;
    };

    union
    {
        __IOM uint8_t VBTBKR84;        /*!< (@ 0x00000D54) VBATT Backup Register 84                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR84_b;
    };

    union
    {
        __IOM uint8_t VBTBKR85;        /*!< (@ 0x00000D55) VBATT Backup Register 85                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR85_b;
    };

    union
    {
        __IOM uint8_t VBTBKR86;        /*!< (@ 0x00000D56) VBATT Backup Register 86                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR86_b;
    };

    union
    {
        __IOM uint8_t VBTBKR87;        /*!< (@ 0x00000D57) VBATT Backup Register 87                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR87_b;
    };

    union
    {
        __IOM uint8_t VBTBKR88;        /*!< (@ 0x00000D58) VBATT Backup Register 88                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR88_b;
    };

    union
    {
        __IOM uint8_t VBTBKR89;        /*!< (@ 0x00000D59) VBATT Backup Register 89                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR89_b;
    };

    union
    {
        __IOM uint8_t VBTBKR90;        /*!< (@ 0x00000D5A) VBATT Backup Register 90                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR90_b;
    };

    union
    {
        __IOM uint8_t VBTBKR91;        /*!< (@ 0x00000D5B) VBATT Backup Register 91                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR91_b;
    };

    union
    {
        __IOM uint8_t VBTBKR92;        /*!< (@ 0x00000D5C) VBATT Backup Register 92                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR92_b;
    };

    union
    {
        __IOM uint8_t VBTBKR93;        /*!< (@ 0x00000D5D) VBATT Backup Register 93                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR93_b;
    };

    union
    {
        __IOM uint8_t VBTBKR94;        /*!< (@ 0x00000D5E) VBATT Backup Register 94                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR94_b;
    };

    union
    {
        __IOM uint8_t VBTBKR95;        /*!< (@ 0x00000D5F) VBATT Backup Register 95                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR95_b;
    };

    union
    {
        __IOM uint8_t VBTBKR96;        /*!< (@ 0x00000D60) VBATT Backup Register 96                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR96_b;
    };

    union
    {
        __IOM uint8_t VBTBKR97;        /*!< (@ 0x00000D61) VBATT Backup Register 97                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR97_b;
    };

    union
    {
        __IOM uint8_t VBTBKR98;        /*!< (@ 0x00000D62) VBATT Backup Register 98                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR98_b;
    };

    union
    {
        __IOM uint8_t VBTBKR99;        /*!< (@ 0x00000D63) VBATT Backup Register 99                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR99_b;
    };

    union
    {
        __IOM uint8_t VBTBKR100;       /*!< (@ 0x00000D64) VBATT Backup Register 100                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR100_b;
    };

    union
    {
        __IOM uint8_t VBTBKR101;       /*!< (@ 0x00000D65) VBATT Backup Register 101                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR101_b;
    };

    union
    {
        __IOM uint8_t VBTBKR102;       /*!< (@ 0x00000D66) VBATT Backup Register 102                                  */

